## Lab 1 : 시험성적 데이터로 데이터 프레임 만들기

In [9]:
import pandas as pd

df1 = pd.DataFrame({'name'   : ['김기훈', '이유진', '박동현', '김민지'],
                   'english' : [90, 80, 60, 70],
                   'math'    : [50, 60, 100, 20]})
df1

  name  english  math
0  김기훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [11]:
print(df1.index)
print(df1.columns)
print(df1.values)

RangeIndex(start=0, stop=4, step=1)
Index(['name', 'english', 'math'], dtype='object')
[['김기훈' 90 50]
 ['이유진' 80 60]
 ['박동현' 60 100]
 ['김민지' 70 20]]

In [32]:
s1 = df1[['math']]
s1

   math
0    50
1    60
2   100
3    20

In [15]:
sum(df1['math'])

230

In [16]:
sum(df1['english'])/4

75.0

In [36]:
df1[['math']].sum()

math    230
dtype: int64

In [18]:
df1['math'].sum()/4

57.5

In [19]:
df1['math'].sum()/df1['math'].count()

57.5

In [20]:
df1['math'].mean()

57.5

In [22]:
s1 = df1[['math']]
s1

   math
0    50
1    60
2   100
3    20

In [23]:
df1[ ['english', 'math'] ]

   english  math
0       90    50
1       80    60
2       60   100
3       70    20

In [24]:
df1[ ['english', 'math'] ] > 70

   english   math
0     True  False
1     True  False
2    False   True
3    False  False

In [25]:
pd_em = df1[['english', 'math']] > 70
pd_em.sum()

english    2
math       1
dtype: int64

## Lab 2 : 데이터 프레임 만들기

In [27]:
df2 = pd.DataFrame([[90, 50], [80, 60], [60, 100], [70, 20]],
                    columns = ['english', 'math'],
                    index    = ['김기훈', '이유진', '박동현', '김민지'])
df2

     english  math
김기훈       90    50
이유진       80    60
박동현       60   100
김민지       70    20

In [28]:
print(df2.index)
print(df2.columns)
print(df2.values)

Index(['김기훈', '이유진', '박동현', '김민지'], dtype='object')
Index(['english', 'math'], dtype='object')
[[ 90  50]
 [ 80  60]
 [ 60 100]
 [ 70  20]]

In [29]:
df2['math'].mean()

57.5

In [30]:
df2 > 50

     english   math
김기훈     True  False
이유진     True   True
박동현     True   True
김민지     True  False

In [31]:
(df2 > 50).sum()

english    4
math       2
dtype: int64

## 실습